tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2_3D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.3);

boundaryField
{
    inletfuel           
    {
	type 		fixedValue;
        value           uniform (0 0 63.2);
    }
    inletair           
    {
	type 		fixedValue;
        value           uniform (0 0 0.3);
    }

    outlet          
    {
	type 		zeroGradient;
	value		uniform (0 0 0.3);
    }

    wallside     
    {
	type 		zeroGradient;
	value		uniform (0 0 0.3);
    }

    wallburner
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
