tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2_3D/0.org/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 2 -2 0 0 0 0 ];

internalField   uniform -15974.1;

boundaryField
{
    inletfuel           
    {
        type  		fixedValue;
	value		uniform -998143;
    }

    inletair           
    {
        type  		fixedValue;
	value		uniform -15974.1;
    }

    outlet          
    {
        type  		zeroGradient;
    }

    "wall.*"       
    {
        type  		zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
