tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2_3D/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inletfuel
    {
	type            turbulentIntensityKineticEnergyInlet;
	intensity	0.2;
	value           uniform 239.65;

    }

    inletair
    {   
	type            turbulentIntensityKineticEnergyInlet;
	intensity	0.05;
	value		uniform 0.00034;
       
    }

    outlet
    {
        type            zeroGradient;
    }

    axis
    {
        type            empty;
    }

    "wall.*"
    {
	type		compressible::kqRWallFunction;
	value		uniform 0.0021;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
