tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2_3D/system/changeDictionaryDict
/*---------------------------------------------------------------------------*\
|=========                 |                                                  |
|\\      /   F ield        | OpenFOAM: The Open Source CFD Toolbox            |
| \\    /    O peration    | Version:  2.1.0                                  |
|  \\  /     A nd          | Web:      www.OpenFOAM.org                       |
|   \\/      M anipulation |                                                  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.1;
    format          ascii;
    class           dictionary;
    location        "system";
    object          changeDictionaryDict;
}

dictionaryReplacement
{
    boundary
    {
        wallside
        {
            type            wall;
        }
    }

}

